from typing import Optional

import pandas as pd

from src.reports import spending_by_category
from src.services import get_cashback_sum
from src.views import get_info_by_request

data_test = [
    {
        "Дата операции": "05.01.2019 14:58:38",
        "Дата платежа": "07.01.2018",
        "Номер карты": "*7197",
        "Статус": "OK",
        "Сумма операции": -120.0,
        "Валюта операции": "RUB",
        "Сумма платежа": -120.0,
        "Валюта платежа": "RUB",
        "Кэшбэк": None,
        "Категория": "Цветы",
        "MCC": 5992.0,
        "Описание": "Magazin  Prestizh",
        "Бонусы (включая кэшбэк)": 2,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 120.0,
    },
    {
        "Дата операции": "04.03.2018 15:00:41",
        "Дата платежа": "05.01.2018",
        "Номер карты": "*7197",
        "Статус": "OK",
        "Сумма операции": -1025.0,
        "Валюта операции": "RUB",
        "Сумма платежа": -1025.0,
        "Валюта платежа": "RUB",
        "Кэшбэк": None,
        "Категория": "Топливо",
        "MCC": 5541.0,
        "Описание": "Pskov AZS 12 K2",
        "Бонусы (включая кэшбэк)": 20,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 1025.0,
    },
    {
        "Дата операции": "04.01.2018 14:05:08",
        "Дата платежа": "06.01.2018",
        "Номер карты": "*7197",
        "Статус": "OK",
        "Сумма операции": -1065.9,
        "Валюта операции": "RUB",
        "Сумма платежа": -1065.9,
        "Валюта платежа": "RUB",
        "Кэшбэк": None,
        "Категория": "Супермаркеты",
        "MCC": 5411.0,
        "Описание": "Пятёрочка",
        "Бонусы (включая кэшбэк)": 21,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 1065.9,
    },
    {
        "Дата операции": "03.01.2020 15:03:35",
        "Дата платежа": "04.01.2018",
        "Номер карты": "*7197",
        "Статус": "OK",
        "Сумма операции": -73.06,
        "Валюта операции": "RUB",
        "Сумма платежа": -73.06,
        "Валюта платежа": "RUB",
        "Кэшбэк": None,
        "Категория": "Супермаркеты",
        "MCC": 5499.0,
        "Описание": "Magazin 25",
        "Бонусы (включая кэшбэк)": 1,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 73.06,
    },
    {
        "Дата операции": "03.01.2018 14:55:21",
        "Дата платежа": "05.01.2018",
        "Номер карты": "*7197",
        "Статус": "OK",
        "Сумма операции": -21.0,
        "Валюта операции": "RUB",
        "Сумма платежа": -21.0,
        "Валюта платежа": "RUB",
        "Кэшбэк": None,
        "Категория": "Красота",
        "MCC": 5977.0,
        "Описание": "OOO Balid",
        "Бонусы (включая кэшбэк)": 0,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 21.0,
    },
    {
        "Дата операции": "01.01.2018 20:27:51",
        "Дата платежа": "04.01.2018",
        "Номер карты": "*7197",
        "Статус": "OK",
        "Сумма операции": -316.0,
        "Валюта операции": "RUB",
        "Сумма платежа": -316.0,
        "Валюта платежа": "RUB",
        "Кэшбэк": None,
        "Категория": "Красота",
        "MCC": 5977.0,
        "Описание": "OOO Balid",
        "Бонусы (включая кэшбэк)": 6,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 316.0,
    },
    {
        "Дата операции": "01.01.2018 12:49:53",
        "Дата платежа": "01.01.2018",
        "Номер карты": None,
        "Статус": "OK",
        "Сумма операции": -3000.0,
        "Валюта операции": "RUB",
        "Сумма платежа": -3000.0,
        "Валюта платежа": "RUB",
        "Кэшбэк": None,
        "Категория": "Переводы",
        "MCC": None,
        "Описание": "Линзомат ТЦ Юность",
        "Бонусы (включая кэшбэк)": 0,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 3000.0,
    },
    {
        "Дата операции": "30.10.2025 19:16:45",
        "Дата платежа": "16.07.2019",
        "Номер карты": "*7197",
        "Статус": "OK",
        "Сумма операции": -101.37,
        "Валюта операции": "RUB",
        "Сумма платежа": -101.37,
        "Валюта платежа": "RUB",
        "Кэшбэк": None,
        "Категория": "Супермаркеты",
        "MCC": 5411.0,
        "Описание": "Магнит",
        "Бонусы (включая кэшбэк)": 2,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 101.37,
    },
]

df_data = pd.DataFrame(data_test)


def main(
    filename: str,
    year: str,
    month: str,
    user_date: str,
    transactions: pd.DataFrame,
    category: str,
    date: Optional[str] = None,
):
    """Общая функция, запускающая проект Главная, Сервисы и Отчеты"""
    info_by_request = get_info_by_request(user_date)
    print(info_by_request)
    info_about_cashback = get_cashback_sum(filename, year, month)
    print(info_about_cashback)
    info_by_category = spending_by_category(transactions, category, date)
    print(info_by_category)


print(
    main(
        "../data/operations.xlsx",
        "2019",
        "07",
        "04-01-2018 15:00:41",
        df_data,
        "Сумма операции с округлением",
        "04-01-2018",
    )
)

